[
  {
    "id": 1,
    "name": "Ageplayer",
    "pairDescription": "Ageplayers typically match well with other ageplayers.",
    "description": "Ageplayers like to play with age as part of their kink. They typically take on a much younger or older age than they actually are, or prefer playing with a partner that does so. Attributes and behavior changes (such as pacifiers, coloring books, speaking in more childlike language, etc.) are commonly paired with this, to enrich the context and make it more appropriate for the played age."
  },
  {
    "id": 3,
    "name": "Brat",
    "pairDescription": "Brats typically match well with brat tamers.",
    "description": "Brats are, in essence, naughty submissives. They find disobedience a form of playfulness rather than letting their dominant down, and require a compatible dominant who will not only teach them a lesson, but also accept that any number of lessons might still not necessarily change this behavior."
  },
  {
    "id": 4,
    "name": "Brat tamer",
    "pairDescription": "Brat Tamers typically match well with brats.",
    "description": "Brat tamers are, in essence, dominants who enjoy handling bratty submissives. They find disobedience a form of playfulness from the side of the submissive, rather than a form of rudeness. They will take no offence to it, but will still teach the sub a well deserved lesson (because, of course, that is why the bratty sub shows such behavior in the first place)."
  },
  {
    "id": 5,
    "name": "Daddy/Mommy",
    "pairDescription": "Daddies/Mommies typically match well with girls/boys.",
    "description": "Daddies/Mommies take on a caretaker role in the relationship, being a guide as much a dominant. Daddies/Mommies dominate their little treasure submissives with an iron fist in a velvet glove: much cuddly and affectionate on the outside, while being as sturdy and hard on the inside as other dominants. Using subtle psychological mechanisms rather than brute power, they nurture their littles into obedience."
  },
  {
    "id": 6,
    "name": "Degrader",
    "pairDescription": "Degraders typically match well with degradees.",
    "description": "Degraders like to degrade and humiliate their play partner(s), either by acting upon them in a degrading way, or by or by forcing them to do things they consider degrading."
  },
  {
    "id": 7,
    "name": "Dominant",
    "pairDescription": "Dominants typically match well with submissives.",
    "description": "Dominants like to be in charge. Some like to have their partner obey them without questioning, others like some resistance while taking it their way. Some are dominant only in the bedroom, others are dominant throughout their daily life as well. Unlike the top roles (giving pain/bondage/degradation), being dominant is more about who decides what happens (and takes the responsibility that comes with it) than about the contents of what happens."
  },
  {
    "id": 8,
    "name": "Degradee",
    "pairDescription": "Degradees typically match well with degraders.",
    "description": "Degradees like to be degraded and humiliated by their play partner(s), either by being acted upon in a degrading way, or by being forced do things they consider degrading."
  },
  {
    "id": 10,
    "name": "Boy/Girl",
    "pairDescription": "Girls/boys typically match well with daddies/mommies.",
    "description": "Littles (girls/boys) are submissive spirits that mix childlike innocence with naughty sexual curiosity. They long for a nurturing loving dominant who plays a guiding, almost parental role in their lives. While they require a softer approach to be dominated than most other submissives, their submission can go a lot deeper and sometimes rival those of slaves."
  },
  {
    "id": 11,
    "name": "Masochist",
    "pairDescription": "Masochists typically match well with sadists.",
    "description": "Masochists enjoy receiving (certain types of) pain from their partner(s), usually in a sexual context. Masochism is independent of pain tolerance: it is purely about the ability to enjoy (or get aroused by) certain levels of pain."
  },
  {
    "id": 12,
    "name": "Master/Mistress",
    "pairDescription": "Masters/Mistresses typically match well with slaves.",
    "description": "Masters/Mistresses receive complete control over the life of their slave(s), and all responsibilities that come with it. They go a step further than dominants in the sense that their power exchange is present 24/7 and in all aspects of their life (except for negotiated exceptions such as during their office jobs). Their primary focus is to create a stable and safe environment for their slave(s), to allow optimal servitude."
  },
  {
    "id": 13,
    "name": "Non-monogamist",
    "pairDescription": "Non-monogamists typically match well with (several) other non-monogamists.",
    "description": "Non-monogamists do not see sexuality as necessarily a 1 on 1 thing. Whether this means they will have several relationships or just see other people outside their relationship (or have even more exquisite constructions) depends entirely on the person and the situation, but they all have one thing in common: their sexuality is more than just between them and one fixed partner."
  },
  {
    "id": 14,
    "name": "Owner",
    "pairDescription": "Owners typically match well with pets.",
    "description": "Owners own pets/properties and take responsibility over them, on a 24/7 basis. Sexuality is not necessarily involved; in some cases animal role play attributes are also provided (e.g. a cage for the pet)."
  },
  {
    "id": 17,
    "name": "Primal (Hunter)",
    "pairDescription": "Hunters typically match well with primal preys.",
    "description": "Primals are mainly focused on their natural instincts and they enjoy letting their inner animal out during sex. The key part for primals play is that the participants show their raw, emotional sexual feelings during play. All of the labels, roles, and protocols go out the window, and the prey can become a snarling, growing, clawing animal hell-bent on getting away from its predator (you)."
  },
  {
    "id": 18,
    "name": "Pet",
    "pairDescription": "Pets typically match well with owners.",
    "description": "Is property of their owner in daily life. Sexuality is not necessarily involved. This role often features some form of animal role play (puppy, kitten, etc.), although that is not a strict necessity."
  },
  {
    "id": 19,
    "name": "Primal (Prey)",
    "pairDescription": "Preys typically match well with primal hunters.",
    "description": "Primals are mainly focused on their natural instincts and they enjoy letting their inner animal out during sex. The key part for primals play is that the participants show their raw, emotional sexual feelings during play. All of the labels, roles, and protocols go out the window, and the prey (you) can become a snarling, growing, clawing animal hell-bent on getting away from its predator."
  },
  {
    "id": 20,
    "name": "Rigger",
    "pairDescription": "Riggers typically match well with rope bunnies.",
    "description": "Riggers like to tie up and restrain their partner(s), using rope and/or other attributes (chains, cuffs, spreader bars, etc.). Whether for sexual enhancement, for art or just for fun, they enjoy having their partners completely at their mercy."
  },
  {
    "id": 21,
    "name": "Rope bunny",
    "pairDescription": "Rope bunnies typically match well with riggers.",
    "description": "Rope bunny likes to be tied up and restrained, using rope and/or other attributes (chains, cuffs, spreader bars, etc.). Whether for sexual enhancement, for art or just for fun, they enjoy being totally at the mercy of their partner(s)."
  },
  {
    "id": 22,
    "name": "Sadist",
    "pairDescription": "Sadists typically match well with masochists.",
    "description": "Sadists enjoy inflicting (certain types of) pain on their partner(s), usually in a sexual context."
  },
  {
    "id": 23,
    "name": "Slave",
    "pairDescription": "Slaves typically match well with masters/mistresses.",
    "description": "Slaves completely hand over the control and responsibilities over their life to their master/mistress. They go a step further than submissives in the sense that their power exchange is present 24/7 and in all aspects of their life (except for negotiated exceptions such as during their office jobs). Serving their master/mistress is their primary focus in life and they rarely have limits for them."
  },
  {
    "id": 24,
    "name": "Submissive",
    "pairDescription": "Submissives typically match well with dominants.",
    "description": "Submissives like to follow. Some like to give the control away to their partner(s), some like to have it forcibly taken from them. Some are submissive only in the bedroom, others are submissive throughout their daily life as well (usually with limitations). Unlike the bottom roles (receiving pain/bondage/degradation), being submissive is more about who decides what happens (and takes the responsibility that comes with it) than about the contents of what happens."
  },
  {
    "id": 25,
    "name": "Switch",
    "pairDescription": "Switches typically match well with other switches.",
    "description": "Switches like to... well, switch. Always taking a dominant or top position is not for them, neither is always taking a submissive or bottom position. Some prefer to switch with the same partner or partners, others have a dominant play partner and a submissive play partner, but in either case they do not fit on one end point of the spectrum."
  },
  {
    "id": 26,
    "name": "Vanilla",
    "pairDescription": "Vanillas typically match well with other vanillas.",
    "description": "Vanilla people enjoy regular, standard sex and relationship models. Nothing wrong with that, as long as you're having fun!"
  },
  {
    "id": 27,
    "name": "Voyeur",
    "pairDescription": "Voyeurs typically match well with exhibitionists.",
    "description": "Voyeurs enjoy watching the nakedness or sexual activity of other people. Definitions vary with respect to whether those being watched should be aware of this, or not."
  },
  {
    "id": 28,
    "name": "Exhibitionist",
    "pairDescription": "Exhibitionists typically match well with voyeurs.",
    "description": "Exhibitionists enjoy showing their naked body or a sexual activity to other people. Definitions vary with respect to whether those being shown this, should be looking for such encounter or not."
  },
  {
    "id": 29,
    "name": "Experimentalist",
    "pairDescription": "Experimentalists typically match well with other experimentalists.",
    "description": "Experimentalists want to have tried it all. An open mind and an insatiable curiosity are their key features, and they will rarely form an opinion before they have gathered first hand experience. They often have plenty of fantasies and will actively pursue to try them out."
  }
]